Autodesk.Revit.DB.DoubleArray
An array that contains doubles.

Autodesk.Revit.DB.DoubleArray.Insert(Autodesk.Revit.DB.Double@,System.Int32)
System.Int32
Insert the specified double into the array.
item: The double to be inserted into the array.
index: The double will be inserted before this index.
Returns: Returns whether the double was inserted into the array.

Autodesk.Revit.DB.DoubleArray.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.DoubleArray.ReverseIterator
Autodesk.Revit.DB.DoubleArrayIterator
Retrieve a backward moving iterator to the array.
Returns: Returns a backward moving iterator to the array.

Autodesk.Revit.DB.DoubleArray.ForwardIterator
Autodesk.Revit.DB.DoubleArrayIterator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.DoubleArray.Append(Autodesk.Revit.DB.Double@)
void
Add the double to the end of the array.
item: The double to be added.

Autodesk.Revit.DB.DoubleArray.Clear
void
Removes every double from the array, rendering it empty.

Autodesk.Revit.DB.DoubleArray.Size
System.Int32
get
Returns the number of doubles that are in the array.

Autodesk.Revit.DB.DoubleArray.Item(System.Int32)
System.Object
Gets or sets a double at a specified index within the array.
index: The index of the double to be set or retrieved.
Returns: Returns the double at the specified index.

Autodesk.Revit.DB.DoubleArray.IsEmpty
System.Boolean
get
Test to see if the array is empty.
Remarks: If the array is empty then True will be returned, otherwise False.